const calendarData = {
    // НЕДЕЛЯ С 27.04 (Знаменатель)
    "2026-04-27": [
        { subject: "Тестирование ПО (3.1)", type: "Лаб", time: "08:30 — 09:55", room: "206" },
        { subject: "Тестирование ПО (3.1)", type: "Лаб", time: "10:05 — 11:30", room: "206" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "315" },
        { subject: "Математика", type: "Прак", time: "13:30 — 14:55", room: "219" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "СК/Зал" }
    ],
    "2026-04-28": [
        { subject: "Иностранный язык (англ)", type: "Прак", time: "08:30 — 09:55", room: "312" },
        { subject: "Иностранный язык (англ)", type: "Прак", time: "10:05 — 11:30", room: "312" },
        { subject: "Математика", type: "Лек", time: "11:40 — 13:05", room: "221" },
        { subject: "История ГП", type: "Сем", time: "13:30 — 14:55", room: "312" }
    ],
    "2026-04-29": [
        { subject: "Тестирование ПО", type: "Лек", time: "08:30 — 09:55", room: "315" },
        { subject: "Математика", type: "Прак", time: "10:05 — 11:30", room: "218" },
        { subject: "Физ. основы измерений", type: "Лек", time: "11:40 — 13:05", room: "305" },
        { subject: "Тестирование ПО", type: "Прак", time: "13:30 — 14:55", room: "206" }
        // Физкультура удалена по просьбе пользователя
    ],
    "2026-04-30": [
        { subject: "Физ. основы измерений", type: "Прак", time: "08:30 — 09:55", room: "305" },
        { subject: "Физика", type: "Прак", time: "10:05 — 11:30", room: "218" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],

    // НЕДЕЛЯ С 04.05 (Числитель)
    "2026-05-04": [
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "219" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "СК/Зал" }
    ],
    "2026-05-05": [
        { subject: "Иностранный язык (англ)", type: "Прак", time: "08:30 — 09:55", room: "312" },
        { subject: "Иностранный язык (англ)", type: "Прак", time: "10:05 — 11:30", room: "312" },
        { subject: "Математика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-05-06": [
        { subject: "Химия", type: "Лек", time: "08:30 — 09:55", room: "315" },
        { subject: "Химия", type: "Прак", time: "10:05 — 11:30", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "11:40 — 13:05", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "13:30 — 14:55", room: "315" }
        // Физкультура удалена
    ],
    "2026-05-07": [
        { subject: "Физ. основы измерений", type: "Лек", time: "10:05 — 11:30", room: "305" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-05-08": [
        { subject: "Физика (3.1)", type: "Лаб", time: "08:30 — 09:55", room: "132" },
        { subject: "Физика (3.1)", type: "Лаб", time: "10:05 — 11:30", room: "132" },
        { subject: "Химия (3.1)", type: "Лаб", time: "13:30 — 14:55", room: "601" },
        { subject: "Химия (3.1)", type: "Лаб", time: "15:05 — 16:30", room: "601" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "Зал" }
    ],

    // НЕДЕЛЯ С 11.05 (Числитель)
    "2026-05-11": [
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "217" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "СК/Зал" }
    ],
    "2026-05-12": [
        { subject: "Иностранный язык (англ)", type: "Прак", time: "08:30 — 09:55", room: "312" },
        { subject: "Иностранный язык (англ)", type: "Прак", time: "10:05 — 11:30", room: "312" },
        { subject: "Математика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-05-13": [
        { subject: "Химия", type: "Лек", time: "08:30 — 09:55", room: "315" },
        { subject: "Химия", type: "Прак", time: "10:05 — 11:30", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "11:40 — 13:05", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "13:30 — 14:55", room: "315" }
        // Физкультура удалена
    ],
    "2026-05-14": [
        { subject: "Физ. основы измерений", type: "Лек", time: "10:05 — 11:30", room: "305" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-05-15": [
        { subject: "Физика (3.1)", type: "Лаб", time: "08:30 — 09:55", room: "132" },
        { subject: "Физика (3.1)", type: "Лаб", time: "10:05 — 11:30", room: "132" },
        { subject: "Химия (3.1)", type: "Лаб", time: "13:30 — 14:55", room: "601" },
        { subject: "Химия (3.1)", type: "Лаб", time: "15:05 — 16:30", room: "601" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "Зал" }
    ],

    // НЕДЕЛЯ С 18.05 (Знаменатель)
    "2026-05-18": [
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "СК/Зал" }
    ],
    "2026-05-19": [
        { subject: "Иностранный язык (англ)", type: "Прак", time: "08:30 — 09:55", room: "312" },
        { subject: "Иностранный язык (англ)", type: "Прак", time: "10:05 — 11:30", room: "312" }
    ],
    "2026-05-20": [
        { subject: "Химия", type: "Лек", time: "08:30 — 09:55", room: "315" },
        { subject: "Химия", type: "Прак", time: "10:05 — 11:30", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "11:40 — 13:05", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "13:30 — 14:55", room: "315" }
        // Физкультура удалена
    ],
    "2026-05-21": [
        { subject: "Физ. основы измерений", type: "Лек", time: "10:05 — 11:30", room: "305" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" },
        { subject: "Математика", type: "Лек", time: "13:30 — 14:55", room: "221" }
    ],
    "2026-05-22": [
        { subject: "Физика (3.1)", type: "Лаб", time: "08:30 — 09:55", room: "132" },
        { subject: "Физика (3.1)", type: "Лаб", time: "10:05 — 11:30", room: "132" },
        { subject: "Химия (3.1)", type: "Лаб", time: "13:30 — 14:55", room: "601" },
        { subject: "Химия (3.1)", type: "Лаб", time: "15:05 — 16:30", room: "601" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "Зал" }
    ],

    // НЕДЕЛЯ С 25.05 (Числитель)
    "2026-05-25": [
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "217" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "СК/Зал" }
    ],
    "2026-05-26": [
        { subject: "Иностранный язык (англ)", type: "Прак", time: "08:30 — 09:55", room: "312" },
        { subject: "Иностранный язык (англ)", type: "Прак", time: "10:05 — 11:30", room: "312" },
        { subject: "Математика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-05-27": [
        { subject: "Химия", type: "Лек", time: "08:30 — 09:55", room: "315" },
        { subject: "Химия", type: "Прак", time: "10:05 — 11:30", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "11:40 — 13:05", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "13:30 — 14:55", room: "315" }
        // Физкультура удалена
    ],
    "2026-05-28": [
        { subject: "Физ. основы измерений", type: "Лек", time: "10:05 — 11:30", room: "305" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-05-29": [
        { subject: "Физика (3.1)", type: "Лаб", time: "08:30 — 09:55", room: "132" },
        { subject: "Физика (3.1)", type: "Лаб", time: "10:05 — 11:30", room: "132" },
        { subject: "Химия (3.1)", type: "Лаб", time: "13:30 — 14:55", room: "601" },
        { subject: "Химия (3.1)", type: "Лаб", time: "15:05 — 16:30", room: "601" },
        { subject: "Физическая культура", type: "Прак", time: "16:40 — 18:05", room: "Зал" }
    ],

    // НЕДЕЛЯ С 01.06 (Числитель)
    "2026-06-02": [
        { subject: "Иностранный язык (англ)", type: "Прак", time: "08:30 — 09:55", room: "312" },
        { subject: "Иностранный язык (англ)", type: "Прак", time: "10:05 — 11:30", room: "312" }
    ],
    "2026-06-03": [
        { subject: "Химия", type: "Лек", time: "08:30 — 09:55", room: "315" },
        { subject: "Химия", type: "Прак", time: "10:05 — 11:30", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "11:40 — 13:05", room: "315" },
        { subject: "Тестирование ПО", type: "Лек", time: "13:30 — 14:55", room: "315" }
        // Физкультура отсутствует в исходном расписании
    ],
    "2026-06-04": [
        { subject: "Физ. основы измерений", type: "Лек", time: "10:05 — 11:30", room: "305" },
        { subject: "Физика", type: "Лек", time: "11:40 — 13:05", room: "221" }
    ],
    "2026-06-05": [
        { subject: "Физика (3.1)", type: "Лаб", time: "08:30 — 09:55", room: "132" },
        { subject: "Физика (3.1)", type: "Лаб", time: "10:05 — 11:30", room: "132" },
        { subject: "Химия (3.1)", type: "Лаб", time: "13:30 — 14:55", room: "601" },
        { subject: "Химия (3.1)", type: "Лаб", time: "15:05 — 16:30", room: "601" }
    ],

    // НЕДЕЛЯ С 08.06 (Пустая)
    "2026-06-08": [], "2026-06-09": [], "2026-06-10": [],
    "2026-06-11": [], "2026-06-12": [], "2026-06-13": []
};